models/deepseek-v2-lite/benchmark_results/p95_stress_20260315_105422/p95_stress.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f28267556c0>, seed=1132, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15840, random_output_len=561, random_range_ratio=0.0, random_prefix_len=12000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p95_stress_20260315_105422', result_filename='p95_rate1_20260315_105422.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-b2a3cfe0-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 10:57:18 [datasets.py:611] Sampling input_len from [15839, 15839] and output_len from [561, 561]
Token indices sequence length is longer than the specified maximum sequence length for this model (29000 > 16384). Running this sequence through the model will result in indexing errors
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [04:22<00:00,  1.31s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  262.86    
Total input tokens:                      5567800   
Total generated tokens:                  112200    
Request throughput (req/s):              0.76      
Output token throughput (tok/s):         426.84    
Peak output token throughput (tok/s):    502.00    
Peak concurrent requests:                56.00     
Total token throughput (tok/s):          21608.06  
---------------Time to First Token----------------
Mean TTFT (ms):                          23407.49  
Median TTFT (ms):                        24217.56  
P50 TTFT (ms):                           24217.56  
P90 TTFT (ms):                           37299.46  
P95 TTFT (ms):                           40001.00  
P99 TTFT (ms):                           44756.62  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          38.71     
Median TPOT (ms):                        38.93     
P50 TPOT (ms):                           38.93     
P90 TPOT (ms):                           39.34     
P95 TPOT (ms):                           39.37     
P99 TPOT (ms):                           39.42     
---------------Inter-token Latency----------------
Mean ITL (ms):                           38.72     
Median ITL (ms):                         38.48     
P50 ITL (ms):                            38.48     
P90 ITL (ms):                            39.94     
P95 ITL (ms):                            41.58     
P99 ITL (ms):                            72.05     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          45086.13  
Median E2EL (ms):                        46223.07  
P50 E2EL (ms):                           46223.07  
P90 E2EL (ms):                           58971.98  
P95 E2EL (ms):                           61294.47  
P99 E2EL (ms):                           64723.06  
==================================================