models/deepseek-v2-lite/benchmark_results/p95_stress_20260315_105422/warmup.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x727f558516c0>, seed=1132, num_prompts=50, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15840, random_output_len=561, random_range_ratio=0.0, random_prefix_len=12000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p95_stress_20260315_105422', result_filename='warmup_discard.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-eff6e371-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-15 10:54:50 [datasets.py:611] Sampling input_len from [15839, 15839] and output_len from [561, 561]
Token indices sequence length is longer than the specified maximum sequence length for this model (29002 > 16384). Running this sequence through the model will result in indexing errors
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 50/50 [01:21<00:00,  1.64s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  81.97     
Total input tokens:                      1391950   
Total generated tokens:                  28050     
Request throughput (req/s):              0.61      
Output token throughput (tok/s):         342.19    
Peak output token throughput (tok/s):    491.00    
Peak concurrent requests:                30.00     
Total token throughput (tok/s):          17323.03  
---------------Time to First Token----------------
Mean TTFT (ms):                          6091.89   
Median TTFT (ms):                        5404.99   
P50 TTFT (ms):                           5404.99   
P90 TTFT (ms):                           11254.16  
P95 TTFT (ms):                           12608.46  
P99 TTFT (ms):                           13281.31  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          37.42     
Median TPOT (ms):                        37.90     
P50 TPOT (ms):                           37.90     
P90 TPOT (ms):                           38.79     
P95 TPOT (ms):                           38.87     
P99 TPOT (ms):                           38.93     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.42     
Median ITL (ms):                         37.77     
P50 ITL (ms):                            37.77     
P90 ITL (ms):                            39.02     
P95 ITL (ms):                            40.26     
P99 ITL (ms):                            70.98     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          27046.28  
Median E2EL (ms):                        26628.53  
P50 E2EL (ms):                           26628.53  
P90 E2EL (ms):                           31618.52  
P95 E2EL (ms):                           32221.85  
P99 E2EL (ms):                           32562.95  
==================================================